// --створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

    // let arrCh = [2, 3, 5, 7, 9];
    // console.log(arrCh);
    // let arrStr = ['Popovych', 'Serhiy', 'Olexandrovych', 'age', '27'];
    // console.log(arrStr);
    // let arr = ['Lesson', 2, 'JavaScript', true, 999];
    // console.log(arr);
    //
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
    // let arr = [];
    // arr[0] = 323;
    // arr[1] = 'okten'
    // console.log(arr);



// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
    // for (i=0; i<10; i++){
    //     document.write('<div> Lorem ipsum dolor sit amet, consectetur adipisicing elit. Dolorem, facere. </div>')
    // }
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
    // for (i=0; i<10; i++){
    //     document.write('<div>', i, ' Lorem ipsum dolor sit amet, consectetur adipisicing elit. Dolorem, facere. </div>')
    // }
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
    // let i = 0;
    // while (i<10){
    //     document.write('<h1> Lorem ipsum dolor sit amet, consectetur adipisicing elit. Earum, explicabo? </h1>')
    //     i++
    // }
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
    // let i = 0;
    // while (i<20){
    //     document.write('<h1>', i, ' Lorem ipsum dolor sit amet, consectetur adipisicing elit. Earum, explicabo? </h1>')
    //     i++
    // }

//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
    // let arr = [1 , 2 , 3 , 4 , 5 , 6 ,7 , 8 , 9 , 10];
    // for (i=0; i<10; i++) {
    //     console.log(arr[i]);
    // }
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
    // let arr = ['Lorem', 'ipsum', 'dolor', 'sit', 'amet', 'consectetur', 'adipisicing', 'elit', 'Officiis', 'voluptatum?'];
    // for (i=0; i<10; i++) {
    //     console.log(arr[i]);
    // }
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
    // let arr = ['Lorem', 10, 15, 'sit', 'amet', 'consectetur', true, 'elit', undefined, 'voluptatum?'];
    // let i = 0;
    // while (i<10){
    //     console.log(arr[i])
    //     i++
    // }
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
    // let arr = ['Lorem', 10, 15, 'sit', 885, 'consectetur', true, 'elit', false, 'voluptatum?'];
    // for (i=0; i<10; i++) {
    //     if (typeof arr[i] === "boolean")
    //     {
    //     console.log(arr[i])
    //     }
    // }
// // - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// let arr = ['Lorem', 10, 15, 'sit', 885, 'consectetur', true, 'elit', false, 'voluptatum?'];
    // for (i=0; i<10; i++) {
    //     if (typeof arr[i] === "number")
    //     {
    //         console.log(arr[i])
    //     }
    // }
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
    // let arr = ['Lorem', 10, 15, 'sit', 885, 'consectetur', true, 'elit', false, 'voluptatum?'];
    // for (i=0; i<10; i++) {
    //     if (typeof arr[i] === "string")
    //     {
    //         console.log(arr[i])
    //     }
    // }


    // let arr = ['Lorem', 10, 15, 'sit', 885, 'consectetur', true, 'elit', false, 'voluptatum?'];
    // let i =0;
    // while (i<arr.length) {
    //     if (typeof arr[i] === "string"){
    //         console.log(arr[i])
    //     }
    //     i++
    // }

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
    // let arr = [];
    // arr[0] = 3233;
    // arr[1] = true;
    // arr[2] = 'lorem';
    // arr[3] = '4586464';
    // arr[4] = false;
    // arr[5] = 11111;
    // arr[6] = 'lesson';
    // arr[7] = 'weoo';
    // arr[8] = false;
    // arr[9] = 'ggghghh';
    // console.log(arr);

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write


// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
//
//
//
// ______________________________________________________________________________________________________________________________________________________
// РОБОТА В АУДИТОРІЇ
// ______________________________________________________________________________________________________________________________________________________
//
//
// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
//     let arr = ['a', 'b', 'c'];
//     for (let i=1; i<4; i++) {
//         arr.push(i)
//     }
//     console.log(arr);
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
            let arr = ['1', '2', '3'];
            for (let i = arr.length - 1; i >= 0; i--) {
            const arrayElement = arr[i];
                console.log(arrayElement);
            }
//
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
//     let arr = [1, 2, 3];
//     for (let i=4; i<7; i++) {
//         arr.push(i)
//     }
//     console.log(arr);
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
//     let arr = [1, 2, 3];
//     for (let i=6; i>=4; i--) {
//         arr.unshift(i)
//     }
//     console.log(arr);
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
//     let arr =['js', 'css', 'jq'];
//     alert(arr.shift())
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
//     let arr = ['js', 'css', 'jq'];
//     alert(arr.pop())
// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].
//     let arr = [1, 2, 3, 4, 5];
//     arr.splice(0,3);
//     console.log(arr);
// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].
//     let arr = [1, 2, 3, 4, 5];
//     arr.splice(2,3);
//     console.log(arr);
// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
//     Підказка. Необхідно стерти елементи, зберегти їх кудись. Дописати букви і після букв повернути стерті цифри
//     let arr = [1, 2, 3, 4, 5];
//     let delElement = arr.splice(3, 2);
//     arr[3] = 'a';
//     arr[4] = 'b';
//     arr[5] = 'c';
//     arr = arr.concat(delElement)
//     console.log(arr);
//
// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
//     Підказка. Працюйте по принципу задачі вище.
//     let arr = [1, 2, 3, 4, 5];
//     arr.splice(1,0, 'a', 'b');
//     arr.splice(6, 0, 'c')
//     arr.push('e');
//     console.log(arr);

// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
            //     for (let i=11; i<=21; i++) {
            //         let arr = [i];
            //
            //         if (i%2===0) {
            //             console.log(arr);
            //         }
            //     }

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
//             let arr  = [];
//             let arr1 = [];
//             for (let i = 0; i < 10; i++) {
//                 arr[i] = i;
//                 arr1[i]=arr[i]
//             }
//             console.log(arr);
//             console.log(arr1);

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//             let arr = [2,17,13,6,22,31,45,66,100,-18];
//             let arr1 = [];
//             for (i=0; i<arr.length;i++){
//                 arr1[i]=arr[i]
//             }
//             console.log(arr);
//             console.log(arr1);
//             //

//
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//             let arr = [2,17,13,6,22,31,45,66,100,-18];
//             let i=-1;
//             while (i<=arr.length){
//                 i++;
//                 console.log(arr[i]);
//             }

//     2. перебрати його циклом for
//             let arr = [2,17,13,6,22,31,45,66,100,-18];
//             for (i=0; i<=arr.length; i++){
//                 console.log(arr[i]);
//             }

//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
    //         let arr = [2,17,13,6,22,31,45,66,100,-18];
    //         let i=0;
    //         while (i<=arr.length){
    //             i++;
    //             if (i%2!=0){
    //                 console.log(arr[i]);
    //             }
    //         }

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
//             let arr = [2,17,13,6,22,31,45,66,100,-18];
//
//             for (i=0; i<=arr.length; i++){
//                 if (i%2===1) {
//                     console.log(arr[i]);
//                 }
//             }

// 5. перебрати циклом while та вивести  числа тільки парні  значення
//             let arr = [2,17,13,6,22,31,45,66,100,-18];
//             let i=0;
//             while (i<=arr.length){
//                 i++;
//                 if (arr[i]%2===0) {
//                     console.log(arr[i]);
//                 }
//             }
// 6. перебрати циклом for та вивести  числа тільки парні  значення
//             let arr = [2,17,13,6,22,31,45,66,100,-18];
//             for (i=0; i<=arr.length; i++){
//             if (arr[i]%2===0) {
//                 console.log(arr[i]);
//                 }
//             }

// 7. замінити кожне число кратне 3 на слово "okten"
//             let arr = [2,17,13,6,22,31,45,66,100,-18];
//             for (i=0; i<=arr.length; i++){
//
//             if (arr[i]%3===0) {
//                 arr[i] ='oketn';
//                 }
//             }
//             console.log(arr);
// 8. вивести масив в зворотньому порядку.
//             let arr = [2,17,13,6,22,31,45,66,100,-18];
//             for (i=0; i<=arr.length; i++){
//                 if (arr[i]%3===0) {
//                     arr[i] ='oketn';
//                 }
//             }
//             console.log(arr);
//             let arrReverse = arr.reverse()
//             console.log(arrReverse);
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// 10
// 1. Створити пустий масив та :
//     a. заповнити його 50 парними числами за допомоги циклу.
//             let arr = [];
//             for (let i = 1; i <= 100; i++) {
//             if (i % 2 === 0) {
//             arr.push(i)
//             }
//             }
//             console.log(arr);
//     b. заповнити його 50 непарними числами за допомоги циклу.
//             let arr = [];
//             for (let i = 1; i <= 100; i++) {
//             if (i % 2 === 1) {
//             arr.push(i)
//             }
//             }
//             console.log(arr);
// //
//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
//                 let arr = [];
//                 for (let i=0; i<20; i++) {
//                     arr.push(Math.round(Math.random() * 100));
//                 }
//                 console.log(arr);

//      d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
//                 let arr = [];
//                 for (let i=0; i<20; i++) {
//                     arr.push(Math.floor(Math.random()*732)+8 )
//                 }
//                 console.log(arr);

// 2. Вивести за допомогою console.log кожен третій елемен
//                 let arr = [];
//                 for (let i=0; i<20; i++) {
//                     arr.push(Math.round(Math.random() * 100));
//                     if (i%3===0){
//                         console.log(arr[i]);
//                     }
//                 }
//                 console.log(arr);

// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
//             let arr = [];
//            for (i=0; i<=50; i++) {
//                arr.push(Math.round(Math.random() * 100));
//                if (arr[i] % 2 === 0 && i % 3 === 0) {
//                    console.log(arr[i]);
//                }
//            }
//             console.log(arr);
// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
//             let arr = [];
//             for (i=0; i<=50; i++) {
//             arr.push(Math.round(Math.random() * 100));
//             if (i % 3 === 0 && arr[i] % 2 === 0) {
//                 let arr1 = [];                           ////////////////
//                 arr1 = arr[i]
//                 console.log(arr1);
//             }
//             }
// console.log(arr);
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
//             let arr = [ 1, 2, 3, 5, 7, 9, 56, 8, 67];
//
//             for (i=0; i<=arr.length; i++){
//             if (arr[i]%2===0) {
//                 console.log(arr[i-1]);
//                 }
//             }

// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//         const arr = [100,250,50,168,120,345,188];
//         let sum = 0;
//         for (const price of arr) {
//             sum += price;
//         }
//         sum = sum/arr.length;
//         console.log(sum);
// //
// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
//             let arr = [];
//             let arr1 = [];
//             for (i=0; i<=10; i++) {
//                 arr.push(Math.round(Math.random() * 10));
//                 arr1 [i]= arr[i] *5;
//             }
//         console.log(arr);
//         console.log(arr1);

// 8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.
//                 const arr = ['string',568, 'name', 54, 3, 4, 87, true, 'js', false];
//                 let arr1 = [];
//             for (let i=0; i<=arr.length; i++) {
//
//                 // console.log(arrI);
//                 if (typeof arr[i] === 'number'){
//                     arr1 = arr[i]
//                     console.log(arr1);
//
//                 }
//             }

//
//     ______________________________________________________________________________________________________________________________________________________
// Додатково
// ______________________________________________________________________________________________________________________________________________________
//
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.